import 'package:flutter/material.dart';

const Color kPrimaryColor = Color(0xff0961F5);
const Color kSplashColor = Color(0x130960F5);
const Color kBackgroundColor = Color(0xFFFAFAFA);

List<String> Level = [
  'الاول الابتدائي',
  'الثاتي الابتدائي',
  'الثالث الابتدائي',
  'الرابع الابتدائي',
  'الخامس الابتدائي',
  'السادس الابتدائي',
  'الاول الاعدادي',
  'الثاني الابتدائي',
  'الثالث الابتدائي',
  'الاول الثانوي',
  'الثاني الابتدائي',
  'الثالث الابتدائي',
];

List<String> subject = [
  'اللغة العربية',
  'اللغة الإنجليزية',
  'الرياضيات',
  'الفيزياء',
  'الكيمياء',
  'الأحياء',
  'الجغرافيا',
  'التاريخ',
  'الفلسفة',
  'التربية الدينية',
  'التربية الوطنية',
  'اللغة الفرنسية',
  'اللغة الألمانية',
  'اللغة الإسبانية',
  'اللغة الإيطالية',
  'اللغة الروسية',
  'الرياضيات الإحصائية',
  'التفكير النقدي'
];
