Map<String, dynamic> classOptionsData = {
  "المرحلة الأبتدائية": {
    "الصف الأول الأبتدائي",
    "الصف الثاني الأبتدائي",
    "الصف الثالث الأبتدائي",
    "الصف الرابع الأبتدائي",
    "الصف الخامس الأبتدائي",
    "الصف السادس الأبتدائي",
  },
  "المرحلة الأعدادية": {
    "الصف الأول الأعدادي",
    "الصف الثاني الأعدادي",
    "الصف الثالث الأعدادي",
  },
  "المرحلة الثانوية": {
    "الصف الأول الثانوي",
    "الصف الثاني الثانوي",
    "الصف الثالث الثانوي",
  },
};

List<String> classOptionsNames = [
  "المرحلة الأبتدائية",
  "المرحلة الأعدادية",
  "المرحلة الثانوية"
];
