import 'package:field_training_app/Core/utils/constatnt.dart';
import 'package:flutter/material.dart';
import 'package:flutter_screenutil/flutter_screenutil.dart';

class Terms extends StatelessWidget {
  final _scrollController = ScrollController();

  Terms({Key? key}) : super(key: key);

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        title: Center(child: const Text('الشروط والتعليمات')),
      ),
      body: ScrollbarTheme(
        data: const ScrollbarThemeData(
            thumbColor: MaterialStatePropertyAll(kPrimaryColor)),
        child: SingleChildScrollView(
          controller:
              _scrollController, 
          child: Column(
            children: [
              const Center(
                child: Text(
                  '!اهلا بك في تطبيق [اسم التطبيق] ',
                  style: TextStyle(fontSize: 20, fontWeight: FontWeight.bold),
                ),
              ),
              SizedBox(height: 15.h),
              Container(
                width: 320.w,
                height: 570.h,
                decoration: BoxDecoration(
                  borderRadius: BorderRadius.circular(12),
                  border: Border.all(color: Colors.grey, width: 1.0),
                  color: Colors.transparent, // Set the desired color here
                ),
                child: Padding(
                  padding: const EdgeInsets.all(8.0),
                  child: Scrollbar(
                    scrollbarOrientation: ScrollbarOrientation.left,
                    thickness: 8,
                    controller: _scrollController,
                    trackVisibility: true,
                    thumbVisibility: true,
                    radius: Radius.circular(20.r),
                    child: const SingleChildScrollView(
                      child: Text(
                        '''
نحن سعداء بانضمامك إلى مجتمعنا التعليمي الذي يهدف إلى توفير تعليم عالي الجودة للجميع. يرجى قراءة الشروط والأحكام التالية بعناية قبل استخدام التطبيق.

مقدمة 1.

يوفر تطبيق [اسم التطبيق] منصة تربط الطلاب بالمعلمين لتقديم دروس خصوصية عبر الإنترنت.
يهدف التطبيق إلى توفير تعليم عالي الجودة بأسعار معقولة للطلاب الذين لا يستطيعون تحمل تكاليف الدروس الخصوصية التقليدية.
من خلال استخدام التطبيق، فإنك توافق على الالتزام بشروط وأحكام الاستخدام هذه.

2. أهلية المستخدم:

يجب أن يكون عمرك 18 عامًا على الأقل لاستخدام التطبيق.
يجب أن تكون مدرسًا مؤهلاً في موضوع معين.
يجب أن يكون لديك اتصال إنترنت موثوق به.

3. استخدام التطبيق:

يمكنك استخدام التطبيق لإنشاء ملف تعريف شخصي، وتحميل سيرتك الذاتية، وتحديد أسعارك، وتلقي طلبات الدروس من الطلاب.
يمكنك أيضًا استخدام التطبيق للتواصل مع الطلاب عبر الرسائل النصية أو الدردشة المرئية.
لا يجوز استخدام التطبيق لأي غرض غير قانوني أو ضار.
لا يجوز مشاركة معلوماتك الشخصية مع أي شخص آخر.

4. الدروس الخصوصية:

أنت مسؤول عن تحديد أسعار الدروس الخاصة بك.
لا تتجاوز قيمة الدرس 50 دولارًا أمريكيًا.
يجب دفع الدروس مقدمًا.
يمكنك إلغاء الدروس واسترداد الأموال في حالة الإلغاء قبل 24 ساعة من موعد الدرس.

5. الخصوصية والأمان:

نحن ملتزمون بحماية خصوصية وأمان معلوماتك الشخصية.
لن نشارك معلوماتك الشخصية مع أي شخص آخر دون إذنك.
نستخدم بروتوكولات أمان قياسية لحماية معلوماتك.

6. إخلاء المسؤولية:

نحن لسنا مسؤولين عن أي خسائر أو أضرار ناتجة عن استخدام التطبيق.
نحن لسنا مسؤولين عن محتوى الدروس الخصوصية.
نحن لسنا مسؤولين عن أي مشاكل تقنية قد تواجهها أثناء استخدام التطبيق.

7. إنهاء الخدمة:

يمكننا إنهاء حسابك في أي وقت لأي سبب من الأسباب.
يمكننا أيضًا إزالة أي محتوى تنشره على التطبيق.

8. التعديلات:

يمكننا تعديل شروط وأحكام الاستخدام هذه في أي وقت.
ستكون التغييرات سارية المفعول فور نشرها على التطبيق.

9. الاتصال بنا:

إذا كانت لديك أي أسئلة، يرجى الاتصال بنا عبر البريد الإلكتروني [البريد الإلكتروني].

10. القانون الحاكم:


تخضع شروط وأحكام الاستخدام هذه لقوانين دولة [الدولة].
كيفية استخدام تطبيق [اسم التطبيق] للمعلمين:

1. إنشاء ملف تعريف:

بعد إنشاء حساب، ستتم مطالبتك بإنشاء ملف تعريف.
املأ معلومات ملفك التعريفي، بما في ذلك سيرتك الذاتية، وخبرتك، ومؤهلاتك، وأسعارك.
يمكنك أيضًا تحميل صورة شخصية وصور إضافية لموادك التعليمية.


2. إضافة مادة:

يمكنك إضافة مادة جديدة عن طريق النقر على "إضافة مادة" في ملفك التعريفي.
أدخل اسم المادة، ووصفها، ومستوى الصعوبة.
يمكنك أيضًا تحميل مواد تعليمية إضافية، مثل الكتب المدرسية أو مقاطع الفيديو.


3. تحديد موعد الدرس:

بمجرد إضافة مادة، يمكنك تحديد موعد الدرس.
حدد التاريخ والوقت ومكان الدرس.
يمكنك أيضًا تحديد عدد الطلاب الذين يمكنهم حضور الدرس.

4. تلقي طلبات التسجيل:

سيتمكن الطلاب من رؤية المواد التي تقدمها وتسجيل حضورهم في الدروس.
ستتلقى إشعارًا عبر البريد الإلكتروني أو التطبيق عندما يسجل طالب حضوره في الدرس.
يمكنك عرض طلبات التسجيل وقبول الطالب أو رفضه.

5. إعطاء الدرس:

بمجرد قبول طلب التسجيل، يمكنك البدء في إعطاء الدرس للطالب.
يمكنك استخدام التطبيق للتواصل مع الطلاب عبر الرسائل النصية أو الدردشة المرئية.
يمكنك أيضًا استخدام التطبيق لمشاركة المواد التعليمية مع الطالب.

6. تلقي الدفع:

سيتم الدفع لك مقابل الدروس التي تقدمها من خلال التطبيق.
سيتم إيداع الأموال في حسابك البنكي أو حساب PayPal.


نصائح إضافية:

تأكد من أن ملفك التعريفي مكتمل ودقيق.
كن متجاوبًا مع طلبات التسجيل.
كن مستعدًا لإعطاء دروس عالية الجودة.
كن محترفًا في جميع تعاملاتك مع الطلاب.

''',
                        style: TextStyle(fontSize: 16),
                        textAlign: TextAlign.right,
                      ),
                    ),
                  ),
                ),
              ),
              SizedBox(height: 15.h),
              ElevatedButton(
                style: ElevatedButton.styleFrom(backgroundColor: kPrimaryColor),
                child: const Text(
                  'موافقة',
                  style: TextStyle(color: Colors.white, fontSize: 20),
                ),
                onPressed: () {},
              )
            ],
          ),
        ),
      ),
    );
  }
}
